# vsoAddParamWidget

## Description
Add a widget for parameter to appear in the Object Info Palette.

```pascal
FUNCTION vsoAddParamWidget(
				widgetID  : LONGINT;
				paramName : STRING;
				locName   : STRING) : BOOLEAN;
```

```python

def vs.vsoAddParamWidget(widgetID, paramName, locName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||
|paramName|STRING||
|locName|STRING||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events